# Brewfile
# Created on March 5, 2025

# Taps
tap "homebrew/bundle"

# Brews
brew "mas"
brew "stow"
brew "fd"
brew "ripgrep"
brew "hyperfine"
brew "eza"
brew "tree"
brew "aspell"
brew "fzf"
brew "mise"
brew "highlight"
brew "starship"
brew "zoxide"
brew "neovim"
brew "zellij"
brew "yazi"
brew "git-delta"
brew "bat"
brew "htop"
brew "ollama"
brew "aider"

# Apple Store apps
mas "Microsoft OneNote", id: 784801555
mas "OneDrive", id: 823766827
mas "Kindle", id: 302584613
mas "WhatsApp", id: 310633997
mas "Trello", id: 1278508951
mas "Flighty", id: 1358823008

# Optional: Add any casks you frequently use
# cask "visual-studio-code"
# cask "docker"
cask "cursor"
cask "ghostty"
cask "zed"
cask "mactex" # ya ya, I still use LaTex for documents!
# Nerd Fonts for coding and terminal
cask "font-fira-code-nerd-font"    # Great for coding
cask "font-jetbrains-mono-nerd-font" # Alternative coding font
cask "font-hack-nerd-font"         # Terminal-friendly
