# Brewfile
# Created on March 5, 2025

# Taps
# tap "homebrew/bundle" # Tap is deprecated, leaving it as an example
tap "steveyegge/beads"
tap "kulesh/tap"
tap "jnsahaj/lumen"

# Brews
brew "coreutils"
brew "node"
brew "ruby"
brew "mas"
brew "stow"
brew "fd"
brew "ripgrep"
brew "hyperfine"
brew "eza"
brew "tree"
brew "aspell"
brew "fzf"
brew "mise"
brew "highlight"
brew "starship"
brew "zoxide"
brew "neovim"
brew "yazi"
brew "git-delta"
brew "lazygit"
brew "bat"
brew "htop"
brew "ollama"
brew "pandoc"
brew "glow"
brew "gh"
brew "docker"
brew "docker-compose"
brew "colima"
brew "yt-dlp"
brew "steveyegge/beads/bd", args: ["head"]
brew "kulesh/tap/tc"
brew "kulesh/tap/aiobscura"
brew "jnsahaj/lumen/lumen"
brew "mdcat"
brew "mole"

# Bugaboo: https://github.com/mas-cli/mas/issues/1029
# Apple Store apps
# mas "Flighty", id: 1358823008
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
# mas "Kindle", id: 302584613
# mas "Microsoft Excel", id: 462058435
# mas "Microsoft OneNote", id: 784801555
# mas "Numbers", id: 409203825
# mas "OneDrive", id: 823766827
# mas "Pages", id: 409201541
# mas "Trello", id: 1278508951
# mas "WhatsApp", id: 310633997
# mas "Xcode", id: 497799835

# Optional: Add any casks you frequently use
# cask "visual-studio-code"
# cask "docker"
cask "cursor"
cask "ghostty"
cask "zed"
cask "mactex" # ya ya, I still use LaTex for documents!
cask "obsidian"
cask "rectangle"
# cask "claude-code" # use "native install"!

# Nerd Fonts for coding and terminal
cask "font-fira-code-nerd-font"    # Great for coding
cask "font-jetbrains-mono-nerd-font" # Alternative coding font
cask "font-hack-nerd-font"         # Terminal-friendly
cask "font-zed-mono-nerd-font"
